# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.team_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.notification_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Reading...
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=2q047ho2aaeuca1rg4ch16cst]
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.team_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.team_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.notification_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.notification_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=805j8tbaxe]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=2uehazb1oj]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Read complete after 0s [id=3xm23aarl9]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=592moyvt0h]
module.common_resources.data.aws_apigatewayv2_api.team_api_api_gateway: Read complete after 0s [id=2w9mgukqzh]
module.common_resources.data.aws_apigatewayv2_api.notification_api_api_gateway: Read complete after 0s [id=8uui01m6v9]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=f1s2kruvcc]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_eF55zHPQ7Fo3MIOaXV2yMccFdoZB]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_8fLtzBmc5QKTGT9sVgwiLdxRd1u3]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-production.connectilly.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-production.connectilly.com",
          - "production-web-khaki.vercel.app",
          - "production-web-connectilly.vercel.app",
          - "production-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "6533~ddc71a2387a0786df1ccbedd0b11a3a6ebdc3ab9" -> "7085~6838829c588a35ff0e3380e3f4924be7ed67fe61"
          ~ "../../../schema/connectilly/v1/schema.graphql"                                                   = "14851~c7b2f1ee2c56e4ffbf8847cbdd4a4a56f2c50914" -> "21455~f67ce409c7f9eef8fad47d528f93f9d9a1989152"
          ~ "../../../src/clients/generate.go"                                                                = "1213~0081e1d3e5d204504784672851165294c61feb37" -> "1437~d49ebbfd1ebb840a4a9510bc18c872f597d37241"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/ConnectillyTeamClient.ts"                 = "1273~feb46369e3a47bb2d5886e3d847fc660cee8ce78"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/ApiError.ts"                         = "740~945196ea0e768d9ce2f1c5ac0d2c09eda0e1243e"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/ApiRequestOptions.ts"                = "577~2013bd376f0bde815ee25ab65383981725281f1e"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/ApiResult.ts"                        = "236~a917641eaa2e615a77ff60fa178c927f2ed5b717"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/BaseHttpRequest.ts"                  = "426~d7936ef7b172d50a019264c3b1d2edaf24ae9c78"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/CancelablePromise.ts"                = "3963~f61c713e20b332582e97f232f66bfd0bfc8fc322"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/FetchHttpRequest.ts"                 = "770~35e2a358f2852952e7d94f4f32ad1de66b36a8b2"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/OpenAPI.ts"                          = "862~a2bebc6da3500167296110575eb5c3d137ceed61"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/core/request.ts"                          = "9539~d60f0515ee2c147d3ea3eabe070e422452f88275"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/index.ts"                                 = "604~bea4ab1f07280dc7831994c811389508af303ff4"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/models/Error.ts"                          = "206~7821983fd3495ed999afe759d81c5f85fea3ac9f"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/schemas/$Error.ts"                        = "413~26f5fee7acee4a18c4ceca4e6f5d9141a7ade0ef"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/services/ApiService.ts"                   = "1022~17831475f4b70266c4c319760a530f7c3f1e7a05"
          + "../../../src/clients/openapi/connectilly/team/v1/fetch/services/TeamService.ts"                  = "1023~6a9a7da16e5a7f32c52a8193d816616457b8445d"
          ~ "../../../src/types/environment.d.ts"                                                             = "423~892e27a75fa4a4455086e99a8274330f7c595522" -> "452~2a1418ac8041512c9d796af641906ca20a773fd9"
            # (119 unchanged elements hidden)
        }
      ~ id          = "dpl_8fLtzBmc5QKTGT9sVgwiLdxRd1u3" -> (known after apply)
      ~ url         = "production-ky33e6bk5-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_eF55zHPQ7Fo3MIOaXV2yMccFdoZB"
        name                       = "production-web"
      + serverless_function_region = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*